In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

import env
import wrangle

# Read in df from SQL

In [2]:
df = wrangle.get_data_from_sql()

# First Look at df

In [3]:
df.head()

  customer_id  monthly_charges  tenure total_charges
0  0013-SMEOE           109.70      71       7904.25
1  0014-BMAQU            84.65      63        5377.8
2  0016-QLJIS            90.45      65        5957.9
3  0017-DINOC            45.20      54       2460.55
4  0017-IUDMW           116.80      72       8456.75

## total_charges is an object... find out why

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
monthly_charges    1695 non-null float64
tenure             1695 non-null int64
total_charges      1695 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [7]:
df.total_charges.value_counts(dropna=False)

           10
1110.05     2
3533.6      2
844.45      2
343.45      2
           ..
7689.8      1
7993.3      1
6297.65     1
6296.75     1
6428.4      1
Name: total_charges, Length: 1678, dtype: int64

### total_charges has 10 values that are spaces or blanks. Handle missing values.

In [11]:
df[df.total_charges == ' ']

     customer_id  monthly_charges  tenure total_charges
234   1371-DWPAZ            56.05       0
416   2520-SGTTA            20.00       0
453   2775-SEFEE            61.90       0
505   3115-CZMZD            20.25       0
524   3213-VVOLG            25.35       0
678   4075-WKNIU            73.35       0
716   4367-NUYAO            25.75       0
726   4472-LVYGI            52.55       0
941   5709-LVOEQ            80.85       0
1293  7644-OMVMY            19.85       0

### It looks like those values are blank bc the tenure is 0. I will change it to 1 since they were probably a customer for about a month.

In [24]:
df.tenure.value_counts().sort_index()

0      10
1       2
2       1
3       3
4       4
     ...
68     65
69     66
70     88
71    137
72    343
Name: tenure, Length: 73, dtype: int64

In [26]:
# Replace any tenures of 0 with 1

df.tenure.replace(0, 1, inplace=True)

In [29]:
# Validate my tenure count for value 1

df.tenure.value_counts().sort_index()

1      12
2       1
3       3
4       4
5       1
     ...
68     65
69     66
70     88
71    137
72    343
Name: tenure, Length: 72, dtype: int64

In [30]:
df[df.tenure == 1]

     customer_id  monthly_charges  tenure total_charges
188   1099-GODLO            20.35       1         20.35
234   1371-DWPAZ            56.05       1
416   2520-SGTTA            20.00       1
453   2775-SEFEE            61.90       1
505   3115-CZMZD            20.25       1
524   3213-VVOLG            25.35       1
678   4075-WKNIU            73.35       1
716   4367-NUYAO            25.75       1
726   4472-LVYGI            52.55       1
941   5709-LVOEQ            80.85       1
1293  7644-OMVMY            19.85       1
1449  8559-WNQZS            20.45       1         20.45

In [ ]:
# Replace the blank total_charges with the monthly_charge for tenure == 1

df.total_charges == ' '